deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
struct Sensor {
	int wet; // completely wet reading
	int dry; // completely dry reading
	int value; // current reading
	int ai; // action index
	int p; // humidity percentage
	bool active = true;
	char name[4];
};

struct SystemState {
	int scr = MS_HOME_SCREEN; // current screen
	Sensor* s = nullptr;      // array of sensors and their state
	bool p = false;			  // indicates whether the pump is active
	bool sa = false;          // indicates whether the sensors are active
	bool vn = false;          // indicates whether the near outlet is open
	bool vm = false;          // indicates whether the mid outlet is open
	bool vf = false;          // indicates whether the far outlet is open
} state;



// An array used for iterating over scheduled
// actions and executing them
Action* availableActions = nullptr;

ActionsList executionList;

struct MSScreen {
	void (*handleButtons)(int buttonValue);
	void (*drawUI)(Action* a);
	int code;
};


// An array containing the available screens
MSScreen* availableScreens;

struct ButtonState {
	int value = 0;
	bool hasChanged = false;
} button;
// end of structures

// Helpers

// Display

void joinStrings(char** source, int size, char* glue, char* target, int skipGlue) {
	int i = 0;
	while (i < size) {

		if (i > skipGlue) {
			strcat(target, glue);
		}

		strcat(target, source[i]);
		i += 1;
	}
}

void initCanvas(GFXcanvas16* c) {
	(*c).setFont(&DEFAULT_FONT);
	(*c).setTextColor(SSD1306_WHITE);
}

void printPositionedText(GFXcanvas16* canvas, const char* text, int x, int y) {
	(*canvas).setCursor(x, y);
	(*canvas).print(text);
}

MSScreenBox printAlignedText(GFXcanvas16* canvas, const char* text, int textSize, int align = MS_H_CENTER | MS_V_CENTER) {
	int fontCorrection = textSize == MS_FONT_TEXT_SIZE_NORMAL ? FONT_BASELINE_CORRECTION_NORMAL : FONT_BASELINE_CORRECTION_LARGE;
	int16_t mx, my;
	uint16_t mw, mh;
	(*canvas).setTextSize(textSize);
	(*canvas).getTextBounds(text, 0, 0, &mx, &my, &mw, &mh);
	(*canvas).setTextColor(SSD1306_WHITE);
	int16_t x = 0;
	int16_t y = 0;

	if ((MS_H_CENTER & align) != 0) {
		x = (int16_t)(SCREEN_WIDTH / 2 - mw / 2);
	}
	else if ((MS_H_LEFT & align) != 0) {
		x = 0;
	}
	else if ((MS_H_RIGHT & align) != 0) {
		x = SCREEN_WIDTH - mw;
	}


	if ((MS_V_CENTER & align) != 0) {
		y = (int16_t)(SCREEN_HEIGHT / 2 - mh / 2);
	}
	else if ((MS_V_TOP & align) != 0) {
		y = fontCorrection;
	}
	else if ((MS_V_BOTTOM & align) != 0) {
		y = SCREEN_HEIGHT - (mh + fontCorrection);
	}
	printPositionedText(canvas, text, x, y);

	return { x, y, mw, mh };
}

MSScreenBox printAlignedTextStack(
	GFXcanvas16* canvas,
	char** text,
	int arraySize,
	int textSize,
	int align,
	int boxAlign = MS_H_CENTER | MS_V_CENTER,
	int spacing = 3) {
	int boxHeight = 0;
	int boxWidth = 0;


	int fontCorrection = textSize == MS_FONT_TEXT_SIZE_NORMAL ? FONT_BASELINE_CORRECTION_NORMAL : FONT_BASELINE_CORRECTION_LARGE;
	boxHeight += spacing * (arraySize - 1) + fontCorrection;
	(*canvas).setTextSize(textSize);

	char** cpointer = text;
	for (int i = 0; i < arraySize; i++) {
		int16_t cx, cy;
		uint16_t cw, ch;
		(*canvas).getTextBounds((*cpointer), 0, 0, &cx, &cy, &cw, &ch);
		boxHeight += ch;

		if (cw > boxWidth) {
			boxWidth = cw;
		}
		cpointer++;
	}

	GFXcanvas16 boxCanvas(boxWidth, boxHeight);
	initCanvas(&boxCanvas);
	boxCanvas.setTextSize(textSize);

	cpointer = text;
	int yCoord = fontCorrection; //offset correction due to font
	int xCoord = 0;
	for (int i = 0; i < arraySize; i++) {
		int16_t cx, cy;
		uint16_t cw, ch;
		boxCanvas.getTextBounds((*cpointer), 0, 0, &cx, &cy, &cw, &ch);

		switch (align) {
		case MS_H_LEFT:
			xCoord = boxWidth / 2 - boxWidth / 2;
			break;
		case MS_H_CENTER:
			xCoord = boxWidth / 2 - cw / 2;
			break;
		case MS_H_RIGHT:
			xCoord = boxWidth - cw;
			break;
		}

		printPositionedText(&boxCanvas, (*cpointer), xCoord, yCoord);
		cpointer++;
		yCoord += (ch + spacing);
	}


	int boxX = 0, boxY = 0;
	int screenWidth = (*canvas).width();
	int screenHeight = (*canvas).height();

	if ((MS_H_CENTER & boxAlign) != 0) {
		boxX = (int16_t)(screenWidth / 2 - boxWidth / 2);
	}
	else if ((MS_H_LEFT & boxAlign) != 0) {
		boxX = 0;
	}
	else if ((MS_H_RIGHT & boxAlign) != 0) {
		boxX = screenWidth - boxWidth;
	}


	if ((MS_V_CENTER & boxAlign) != 0) {
		boxY = (int16_t)(screenHeight / 2 - boxHeight / 2);
	}
	else if ((MS_V_TOP & boxAlign) != 0) {
		boxY = 0;
	}
	else if ((MS_V_BOTTOM & boxAlign) != 0) {
		boxY = screenHeight - boxHeight;
	}

	(*canvas).drawRGBBitmap(boxX, boxY, boxCanvas.getBuffer(), boxWidth, boxHeight);

	return { boxX, boxY, boxWidth, boxHeight };;
}

void drawStartingPromptScreen(Adafruit_SSD1306* display) {
	char* prompt[] = { "Actions:", "B1 - init", "B2 - start" };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, prompt, 3, DEFAULT_TEXT_SIZE, MS_H_LEFT, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawDryValuesScreen(Adafruit_SSD1306* display) {
	sprintf(stringPool20b1, "Near: %d", state.s[MS_SENSOR_NEAR].dry);
	sprintf(stringPool20b2, "Mid: %d", state.s[MS_SENSOR_MID].dry);
	sprintf(stringPool20b3, "Far: %d", state.s[MS_SENSOR_FAR].dry);

	char* message[] = { "Dry values:", stringPool20b1, stringPool20b2, stringPool20b3 };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 4, DEFAULT_TEXT_SIZE, MS_H_LEFT, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawWetValuesScreen(Adafruit_SSD1306* display) {
	sprintf(stringPool20b1, "Near: %d", state.s[MS_SENSOR_NEAR].wet);
	sprintf(stringPool20b2, "Mid: %d", state.s[MS_SENSOR_MID].wet);
	sprintf(stringPool20b3, "Far: %d", state.s[MS_SENSOR_FAR].wet);

	char* message[] = { "Wet values:", stringPool20b1, stringPool20b2, stringPool20b3 };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 4, DEFAULT_TEXT_SIZE, MS_H_LEFT, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawStartingValuesScreen(Adafruit_SSD1306* display) {
	drawDryValuesScreen(display);
	delay(5000);
	drawWetValuesScreen(display);
	delay(5000);

	(*display).clearDisplay();

	sprintf(stringPool20b1, "APV: %d%%", settings.apv);
	sprintf(stringPool20b2, "DAPV: %d%%", settings.dapv);

	char* message[] = { "Thresholds:", stringPool20b1, stringPool20b2 };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 3, DEFAULT_TEXT_SIZE, MS_H_LEFT, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

