deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
void showTextCaptionScreen(Adafruit_SSD1306* display, const char* caption) {
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedText(&canvas, caption, MS_FONT_TEXT_SIZE_LARGE, MS_V_CENTER | MS_H_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void showActionPromptScreen(Adafruit_SSD1306* display, char* btn, char* action) {
	sprintf(stringPool20b1, "Press %s", btn);
	char* message[] = { stringPool20b1, action };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	printAlignedTextStack(&canvas, message, 2, DEFAULT_TEXT_SIZE, MS_H_CENTER, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

void drawSplashScreen(Adafruit_SSD1306* display) {
	char* texts[] = { "Irrigation", "System", "Version: 0.1" };
	GFXcanvas16 canvas(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&canvas);
	canvas.drawRoundRect(0, 0, SCREEN_WIDTH, SCREEN_HEIGHT, 10, SSD1306_WHITE);
	printAlignedTextStack(&canvas, texts, 3, DEFAULT_TEXT_SIZE, MS_H_CENTER, MS_H_CENTER | MS_V_CENTER);
	(*display).drawRGBBitmap(0, 0, canvas.getBuffer(), SCREEN_WIDTH, SCREEN_HEIGHT);
	(*display).display();
}

// end of Display


void extractMedianPinValueForProperty(int delayInterval, int* near, int* mid, int* far) {
	int farV = 0;
	int midV = 0;
	int nearV = 0;

	for (int i = 0; i < 10; i++) {
		farV += fixedAnalogRead(PIN_FAR);
		midV += fixedAnalogRead(PIN_MID);
		nearV += fixedAnalogRead(PIN_NEAR);
		if (delayInterval > 0) {
			delay(delayInterval);
		}
	}

	(*far) = (int)(farV / 10);
	(*mid) = (int)(midV / 10);
	(*near) = (int)(nearV / 10);
}

// End of Helpers

// Actions

// Outlets

// Far

void startFarOutlet(Action* a) {
	digitalWrite(PIN_VALVE_FAR, LOW);
	state.vf = true;
}

void tickFarOutlet(Action* a) {
}

void stopFarOutlet(Action* a) {
	digitalWrite(PIN_VALVE_FAR, HIGH);
	state.vf = false;
}

// end of Far

// Mid

void startMidOutlet(Action* a) {
	digitalWrite(PIN_VALVE_MID, LOW);
	state.vm = true;
}

void tickMidOutlet(Action* a) {
}

void stopMidOutlet(Action* a) {
	digitalWrite(PIN_VALVE_MID, HIGH);
	state.vm = false;
}

// end of Mid

// Near

void startNearOutlet(Action* a) {
	digitalWrite(PIN_VALVE_NEAR, LOW);
	state.vn = true;
}

void tickNearOutlet(Action* a) {
}

void stopNearOutlet(Action* a) {
	digitalWrite(PIN_VALVE_NEAR, HIGH);
	state.vn = false;
}

// end of Near
//

// wifi
WebServer server(80);

char* _resolveWiFIStatusString(char* target, int status) {
	char* message;
	switch (wifi.state) {
	case MS_WIFI_CONNECTED:
		message = "connected";
		break;
	case MS_WIFI_DISCONNECTED:
		message = "disconnected";
		break;
	case MS_WIFI_FAILED:
		message = "failed";
		break;
	case MS_WIFI_LOST:
		message = "lost";
		break;
	case MS_WIFI_IDLE:
		message = "idle";
		break;
	case MS_WIFI_NO_SSID:
		message = "no ssid";
		break;
	case MS_WIFI_SCAN_COMPL:
		message = "scan compl";
		break;
	case MS_WIFI_NO_SHIELD:
		message = "no shield";
		break;
	default:
		message = "off";
		break;
	}

	sprintf(target, "%s%s", message);
	return target;
}


void connectWiFi() {
	WiFi.mode(WIFI_STA);
	WiFi.setHostname("MS-System");
	WiFi.begin(wifi.ssid, wifi.password);
}
bool serverActivated = false;

void updateWiFiStatus() {
	switch (WiFi.status()) {
	case WL_CONNECTED:
		wifi.state = MS_WIFI_CONNECTED;
		break;
	case WL_DISCONNECTED:
		wifi.state = MS_WIFI_DISCONNECTED;
		break;
	case WL_CONNECT_FAILED:
		wifi.state = MS_WIFI_FAILED;
		WiFi.reconnect();
		break;
	case WL_CONNECTION_LOST:
		wifi.state = MS_WIFI_LOST;
		WiFi.reconnect();
		break;
	case WL_IDLE_STATUS:
		wifi.state = MS_WIFI_IDLE;
		break;
	case WL_NO_SSID_AVAIL:
		wifi.state = MS_WIFI_NO_SSID;
		break;
	case WL_SCAN_COMPLETED:
		wifi.state = MS_WIFI_SCAN_COMPL;
		break;
	case WL_NO_SHIELD:
		wifi.state = MS_WIFI_NO_SHIELD;
		break;
	}
}

void handleStatus() {
	server.send(200, "application/json", "{\"status\":\"OK\"}");
}


void setupWebServer() {
	server.on("/status", HTTP_GET, &handleStatus);
	server.begin();
}

void startWifi(Action* a) {
	connectWiFi();
	setupWebServer();
}

void tickWifi(Action* a) {
	updateWiFiStatus();
	server.handleClient();
}

void stopWifi(Action* a) {
	server.stop();
	WiFi.disconnect();
	WiFi.mode(WIFI_OFF);
	wifi.state = MS_WIFI_STOPPED;
}

// end of wifi

// Sensors

void startSensors(Action* a) {
	digitalWrite(SENSOR_PIN, SENSOR_PIN_HIGH);
	state.sa = true;
}

void stopSensors(Action* a) {
	digitalWrite(SENSOR_PIN, SENSOR_PIN_LOW);
	state.sa = false;
}

void tickSensors(Action* a) {

	extractMedianPinValueForProperty(0, &state.s[MS_SENSOR_NEAR].value, &state.s[MS_SENSOR_MID].value, &state.s[MS_SENSOR_FAR].value);

	bool activate = false;
	Action** acandidates = (Action**)malloc(sizeof(Action*) * SENSORS_COUNT);
	int pc = 0;
	int ac = 0;
	for (int i = 0; i < SENSORS_COUNT; i++) {
		Sensor* se = &state.s[i];
		Action* ca = &availableActions[(*se).ai];
		float v = (float)(*se).value;
		float d = (float)(*se).dry;
		float w = (float)(*se).wet;
		float dwd = _max(0.00001, d - w);

		float mp = ((d - _min(_max(v, w), d)) / dwd) * 100.0;
		(*se).p = (int)mp;

		activate = (*se).active && (bool)((long)mp < (state.p ? settings.dapv : settings.apv));

		acandidates[i] = nullptr;
		if (activate && ca != nullptr) {
			ac++;
			if ((*ca).state == MS_NON_ACTIVE) {
				acandidates[i] = ca;
				pc++;
			}
			else if ((*ca).state == MS_PENDING) {
				requestStop(&executionList, ca);
			}
		}
		else if (ca != nullptr) {
			// Stop the action for which activate is false
			requestStop(&executionList, ca);
		}
	}

	// if the available outlets are equal to the 
	// ones needed to be activated - we select the 
	// one that was activated the earliest
	if (pc > 0 && pc == ac) {

		Action* ts = nullptr;
		for (int i = 0; i < SENSORS_COUNT; i++) {
			Action* c = acandidates[i];

			if (c != nullptr) {
				if (ts != nullptr) {
					if ((*c).st < (*ts).st) {
						ts = c;
					}
				}
				else {
					ts = c;
				}
			}
		}

		if (ts != nullptr) {
			scheduleAction(&executionList, ts);
		}
	}

