deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
	(*a).ti = availableActions[PUMP_ACTION].state == MS_CHILD_RUNNING ? settings.siw : settings.sid;
	free(acandidates);
}

//end of sensors

// Display

const char* _hsResolveSensorInfo(char* target, Sensor* s) {
	if ((*s).active) {
		sprintf(target, "%d%%", (*s).p);
	}
	else {
		return MS_OFF_STRING;
	}
	return target;
}

void drawHomeScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	sprintf(stringPool30b1, "PA: %d%% PD: %d%%", settings.apv, settings.dapv);
	sprintf(stringPool30b2, "N: %s M: %s F: %s", _hsResolveSensorInfo(stringPool5b1, &state.s[MS_SENSOR_NEAR]), _hsResolveSensorInfo(stringPool5b2, &state.s[MS_SENSOR_MID]), _hsResolveSensorInfo(stringPool5b3, &state.s[MS_SENSOR_FAR]));
	sprintf(stringPool30b3, "VN: %s VM: %s VF: %s", state.vn ? MS_ON_STRING : MS_OFF_STRING, state.vm ? MS_ON_STRING : MS_OFF_STRING, state.vf ? MS_ON_STRING : MS_OFF_STRING);
	sprintf(stringPool30b4, "PUMP: %s SENSORS: %s", state.p ? MS_ON_STRING : MS_OFF_STRING, state.sa ? MS_ON_STRING : MS_OFF_STRING);
	sprintf(stringPool20b1, "WIFI: %s", _resolveWiFIStatusString(stringPool20b2, wifi.state));
	char* message[] = { stringPool30b1, stringPool30b2, stringPool30b3, stringPool30b4, stringPool20b1 };
	printAlignedTextStack(&mainCanvas, message, 5, 1, MS_H_CENTER, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, "B1 - menu", 1, (MS_H_CENTER | MS_V_BOTTOM));
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleHomeScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_MENU_SCREEN;
	}
}

void drawThresholdsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	sprintf(stringPool20b1, "APV: %d%%", settings.apv);
	sprintf(stringPool20b2, "DAPV: %d%%", settings.dapv);
	char* message[] = { stringPool20b1, stringPool20b2 };
	printAlignedTextStack(&mainCanvas, message, 2, MS_FONT_TEXT_SIZE_LARGE, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);

	printAlignedText(&mainCanvas, "B1 - Back, B2-B3 - edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleThresholdsSettingsScreen(int buttonValue) {

	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		int upperLimit = settings.dapv - 5;
		int nv = _min((settings.apv + 5) % settings.dapv, upperLimit);
		settings.apv = nv;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		int nv = _max(_min((settings.dapv + 5) % 105, 100), settings.apv + 5);
		settings.dapv = nv;

	}

#ifdef ARDUINO_ARCH_ESP32
	preferences.begin(MS_PREFERENCES_ID, false);
	preferences.putLong(MS_APV_SETTING_KEY, settings.apv);
	preferences.putLong(MS_DAPV_SETTING_KEY, settings.dapv);
	preferences.end();
#endif
}

void drawSensorSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	int circleRadius = 17;
	int spacing = 3;
	int boxWidth = 2 * spacing + 3 * (circleRadius * 2);
	int boxX = SCREEN_WIDTH / 2 - boxWidth / 2 + circleRadius;
	int boxY = circleRadius;

	for (int i = 0; i < SENSORS_COUNT; i++) {
		Sensor* s = &state.s[i];
		bool isActive = (*s).active;
		if ((*s).active) {
			mainCanvas.fillCircle(boxX, boxY, circleRadius, SSD1306_WHITE);
		}
		else {

			mainCanvas.drawCircle(boxX, boxY, circleRadius, SSD1306_WHITE);
		}
		int16_t x, y;
		uint16_t w, h;
		sprintf(stringPool10b1, "%d%%", (*s).p);
		mainCanvas.getTextBounds(isActive ? stringPool10b1 : MS_OFF_STRING, 0, 0, &x, &y, &w, &h);
		mainCanvas.setCursor(boxX - w / 2 + w % 2, boxY - h / 2 + h % 2 + FONT_BASELINE_CORRECTION_NORMAL / 2);
		mainCanvas.setTextColor(isActive ? SSD1306_BLACK : SSD1306_WHITE);
		mainCanvas.setTextSize(MS_FONT_TEXT_SIZE_NORMAL);

		if (isActive) {
			mainCanvas.print(stringPool10b1);
		}
		else {
			mainCanvas.print(MS_OFF_STRING);
		}

		mainCanvas.getTextBounds((*s).name, 0, 0, &x, &y, &w, &h);
		mainCanvas.setTextColor(SSD1306_WHITE);
		printPositionedText(&mainCanvas, (*s).name, boxX - w / 2, boxY + circleRadius + spacing + FONT_BASELINE_CORRECTION_NORMAL);

		boxX += circleRadius * 2 + spacing;
	}

	printAlignedText(&mainCanvas, "B1 - Back, B2-B4 - edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleSensorSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		bool isActive = state.s[MS_SENSOR_FAR].active = !state.s[MS_SENSOR_FAR].active;
		if (!isActive) {
			availableActions[OUTLET_MID_ACTION].lst = 0;
			availableActions[OUTLET_MID_ACTION].st = 0;
		}
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		bool isActive = state.s[MS_SENSOR_MID].active = !state.s[MS_SENSOR_MID].active;
		if (!isActive) {
			availableActions[OUTLET_MID_ACTION].lst = 0;
			availableActions[OUTLET_MID_ACTION].st = 0;
		}
	}
	else if (buttonValue > BUTTON_4_LOW && buttonValue < BUTTON_4_HIGH) {
		bool isActive = state.s[MS_SENSOR_NEAR].active = !state.s[MS_SENSOR_NEAR].active;
		if (!isActive) {
			availableActions[OUTLET_NEAR_ACTION].lst = 0;
			availableActions[OUTLET_NEAR_ACTION].st = 0;
		}

	}

#ifdef ARDUINO_ARCH_ESP32
	preferences.begin(MS_PREFERENCES_ID, false);
	preferences.putBool(MS_FAR_ACTIVE_SETTING_KEY, state.s[MS_SENSOR_FAR].active);
	preferences.putBool(MS_MID_ACTIVE_SETTING_KEY, state.s[MS_SENSOR_MID].active);
	preferences.putBool(MS_NEAR_ACTIVE_SETTING_KEY, state.s[MS_SENSOR_NEAR].active);
	preferences.end();
#endif
}

void drawWIFIToggleScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	const char* wifiCaption = "WIFI";
	int circleRadius = 17;
	int spacing = 3;
	int boxWidth = 2 * spacing + (circleRadius * 2);
	int boxX = SCREEN_WIDTH / 2 - boxWidth / 2 + circleRadius;
	int boxY = circleRadius;

	bool isActive = availableActions[WIFI_ACTION].state == MS_RUNNING ? true : false;
	if (isActive) {
		mainCanvas.fillCircle(boxX, boxY, circleRadius, SSD1306_WHITE);
	}
	else {
		mainCanvas.drawCircle(boxX, boxY, circleRadius, SSD1306_WHITE);
	}
	int16_t x, y;
	uint16_t w, h;
	sprintf(stringPool10b1, "%s", isActive ? "on" : "off");
	mainCanvas.getTextBounds(stringPool10b1, 0, 0, &x, &y, &w, &h);
	mainCanvas.setCursor(boxX - w / 2 + w % 2, boxY - h / 2 + h % 2 + FONT_BASELINE_CORRECTION_NORMAL / 2);
	mainCanvas.setTextColor(isActive ? SSD1306_BLACK : SSD1306_WHITE);
	mainCanvas.setTextSize(MS_FONT_TEXT_SIZE_NORMAL);
	mainCanvas.print(stringPool10b1);
	mainCanvas.getTextBounds(wifiCaption, 0, 0, &x, &y, &w, &h);
	mainCanvas.setTextColor(SSD1306_WHITE);
	printPositionedText(&mainCanvas, wifiCaption, boxX - w / 2, boxY + circleRadius + spacing + FONT_BASELINE_CORRECTION_NORMAL);

