deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
void handleProcessesScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_MENU_SCREEN;
	}
}

void drawSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - Intervals", "B3 - Sensors", "B4 - Thresholds" };
	printAlignedTextStack(&mainCanvas, text, 3, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_MENU_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		state.scr = MS_SENSOR_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_4_LOW && buttonValue < BUTTON_4_HIGH) {
		state.scr = MS_THRESHOLDS_SETTINGS_SCREEN;
	}
}

void drawSensorIntervalsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);

	sprintf(stringPool20b1, "Pump off: %d s", settings.sid / 1000);
	sprintf(stringPool20b2, "Pump on: %d s", settings.siw / 1000);
	sprintf(stringPool20b3, "ON duration: %d s", availableActions[SENSORS_ACTION].td / 1000);
	char* message[] = { stringPool20b1, stringPool20b2, stringPool20b3 };
	printAlignedTextStack(&mainCanvas, message, 3, MS_FONT_TEXT_SIZE_NORMAL, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);

	printAlignedText(&mainCanvas, "B1 - Back, B2-B4 - Edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleSensorIntervalsSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		int step = 10000;
		int upperLimit = 5 * 6 * step;
		int nv = _max((settings.sid + step) % (upperLimit + step), step);
		settings.sid = nv;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		int step = 5000;
		int upperLimit = 6 * step;
		int nv = _max((settings.siw + step) % (upperLimit + step), step);
		settings.siw = nv;
	}
	else if (buttonValue > BUTTON_4_LOW && buttonValue < BUTTON_4_HIGH) {
		int step = 1000;
		int upperLimit = 15 * step;
		unsigned long* td = &availableActions[SENSORS_ACTION].td;
		int nv = _max(((*td) + step) % (upperLimit + step), step);
		(*td) = nv;
	}

#ifdef ARDUINO_ARCH_ESP32
	preferences.begin(MS_PREFERENCES_ID, false);
	preferences.putULong(MS_SENSOR_INTERVAL_PUMPING, settings.siw);
	preferences.putULong(MS_SENSOR_INTERVAL_DRY, settings.sid);
	preferences.putULong(MS_SENSOR_INTERVAL_ON, availableActions[SENSORS_ACTION].td);
	preferences.end();
#endif
}

void drawPumpIntervalsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	sprintf(stringPool20b1, "max(T): %d min", settings.pd / 60000);
	sprintf(stringPool20b2, "Re-act in: %d min", settings.pi / 60000);
	char* message[] = { stringPool20b1, stringPool20b2 };
	printAlignedTextStack(&mainCanvas, message, 2, MS_FONT_TEXT_SIZE_NORMAL, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);

	printAlignedText(&mainCanvas, "B1 - Back, B2-B3 - edit", MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handlePumpIntervalsSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		int minute = 60000;
		int upperLimit = 5 * minute;
		int nv = _max((settings.pd + minute) % (upperLimit + minute), minute);
		settings.pd = nv;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		int minute = 60000;
		int upperLimit = 20 * minute;
		int nv = _max((settings.pi + minute) % (upperLimit + minute), minute);
		settings.pi = nv;
	}

#ifdef ARDUINO_ARCH_ESP32
	preferences.begin(MS_PREFERENCES_ID, false);
	preferences.putULong(MS_PUMP_MAX_DURATION, settings.pd);
	preferences.putULong(MS_PUMP_REACT_INT_DURATION, settings.pi);
	preferences.end();
#endif
}

void drawIntervalsSettingsScreen(Action* a) {
	GFXcanvas16 mainCanvas = GFXcanvas16(SCREEN_WIDTH, SCREEN_HEIGHT);
	initCanvas(&mainCanvas);
	char* text[] = { "B2 - Pump intervals", "B3 - Sensor intervals" };
	printAlignedTextStack(&mainCanvas, text, 2, 1, MS_H_LEFT, MS_H_CENTER | MS_V_TOP);
	printAlignedText(&mainCanvas, MS_BACK_BUTTON_PROMPT, MS_FONT_TEXT_SIZE_NORMAL, MS_H_CENTER | MS_V_BOTTOM);
	display.drawRGBBitmap(0, 0, mainCanvas.getBuffer(), mainCanvas.width(), mainCanvas.height());
	display.display();
}

void handleIntervalsSettingsScreen(int buttonValue) {
	if (buttonValue > BUTTON_1_LOW && buttonValue < BUTTON_1_HIGH) {
		state.scr = MS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_2_LOW && buttonValue < BUTTON_2_HIGH) {
		state.scr = MS_PUMP_INTERVALS_SETTINGS_SCREEN;
	}
	else if (buttonValue > BUTTON_3_LOW && buttonValue < BUTTON_3_HIGH) {
		state.scr = MS_SENSOR_INTERVALS_SETTINGS_SCREEN;
	}
}

void startBuildScreen(Action* a) {
	int newValue = readButton();
	if (newValue != button.value) {
		button.hasChanged = true;
	}

	button.value = newValue;
	display.clearDisplay();
}

void tickBuildScreen(Action* a) {
	int screenIndex = state.scr;
	if (screenIndex < SCREENS_COUNT) {
		MSScreen* current = (MSScreen*)&availableScreens[screenIndex];
		(*current).drawUI(a);
		if (button.hasChanged) {
			(*current).handleButtons(button.value);
			button.hasChanged = false;
		}
	}
}

void stopBuildScreen(Action* a) {
	button.hasChanged = false;
	button.value = 0;
}

// end of Display

// Pump
void startPump(Action* a) {
	digitalWrite(PUMP_PIN, PUMP_PIN_HIGH);
	state.p = true;
}

void stopPump(Action* a) {
	digitalWrite(PUMP_PIN, PUMP_PIN_LOW);
	state.p = false;
}

void tickPump(Action* a) {
}

//end of pump

// end of Actions


void populateScreens() {
	availableScreens[MS_HOME_SCREEN].drawUI = &drawHomeScreen;
	availableScreens[MS_HOME_SCREEN].handleButtons = &handleHomeScreen;

	availableScreens[MS_SETTINGS_SCREEN].drawUI = &drawSettingsScreen;
	availableScreens[MS_SETTINGS_SCREEN].handleButtons = &handleSettingsScreen;

