deyanginev/ATmega328P-watering-system/MoisturingSystem/MoisturingSystem.ino
	// draw home action
	availableActions[DRAW_UI_ACTION].tick = &tickBuildScreen;
	availableActions[DRAW_UI_ACTION].frozen = true;
	availableActions[DRAW_UI_ACTION].stopRequested = false;
	availableActions[DRAW_UI_ACTION].start = &startBuildScreen;
	availableActions[DRAW_UI_ACTION].stop = &stopBuildScreen;
	availableActions[DRAW_UI_ACTION].ti = 1000;
	availableActions[DRAW_UI_ACTION].td = 100;
	availableActions[DRAW_UI_ACTION].clear = false;
	availableActions[DRAW_UI_ACTION].to = 0;
	availableActions[DRAW_UI_ACTION].state = MS_NON_ACTIVE;
	availableActions[DRAW_UI_ACTION].child = nullptr;
	availableActions[DRAW_UI_ACTION].lst = 0;
	availableActions[DRAW_UI_ACTION].st = 0;
	availableActions[DRAW_UI_ACTION].name = "ui";
}

int readButton() {

	int res = fixedAnalogRead(BUTTONS_PIN);
	Serial.println(res);
	return res;
}

void setupInitialState() {
	if (availableActions != nullptr) {
		// init the Actions library
		initActionsList();

		// populate the available screens
		populateScreens();

		// populate the available actions
		populateActions();

		// set initial screen to draw
		state.scr = MS_HOME_SCREEN;

		// schedule sensors and UI actions
		scheduleAction(&executionList, &availableActions[SENSORS_ACTION]);
		scheduleAction(&executionList, &availableActions[DRAW_UI_ACTION]);
	}
	else {
#ifdef DEBUG
		Serial.println(F("MEM: Actions"));
#endif
	}
}

void initActionsList() {
	executionList.availableActions = availableActions;
	executionList.availableActionsCount = ACTIONS_COUNT;
}

void allocateMemPools() {
	availableScreens = (MSScreen*)calloc(SCREENS_COUNT, sizeof(MSScreen));
	availableActions = (Action*)calloc(ACTIONS_COUNT, sizeof(Action));
	state.s = (Sensor*)calloc(SENSORS_COUNT, sizeof(Sensor));
}

void initDisplay(Adafruit_SSD1306* display) {
	if (!(*display).begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS)) {
		Serial.println(F("SSD1306 failed"));
		for (;;); // Don't proceed, loop forever
	}
	(*display).clearDisplay();
}

void ms_init() {
	// init must be made with completely dry state values

	initDisplay(&display);
	drawSplashScreen(&display);
	delay(5000);
	drawStartingPromptScreen(&display);

	int bs = 0;
	bool init = false;
	while (true) {
		int i = 100;
		while (i-- > 0) {
			bs = readButton();
			Serial.println(bs);
		}

		if (bs > BUTTON_1_LOW && bs < BUTTON_1_HIGH) {
			init = true;
			break;
		}
		else if (bs > BUTTON_2_LOW && bs < BUTTON_2_HIGH) {
			init = false;
			break;
		}
	}
#ifdef ARDUINO_ARCH_ESP32
	preferences.begin(MS_PREFERENCES_ID, false);
#endif
	sprintf(state.s[MS_SENSOR_NEAR].name, "near");
	sprintf(state.s[MS_SENSOR_MID].name, "mid");
	sprintf(state.s[MS_SENSOR_FAR].name, "far");
	// we start with stored values normally
	if (!init) {

#ifdef ARDUINO_ARCH_ESP32
		state.s[MS_SENSOR_NEAR].dry = preferences.getInt(MS_NEAR_DRY_SETTING_KEY);
		state.s[MS_SENSOR_MID].dry = preferences.getInt(MS_MID_DRY_SETTING_KEY);
		state.s[MS_SENSOR_FAR].dry = preferences.getInt(MS_FAR_DRY_SETTING_KEY);

		state.s[MS_SENSOR_NEAR].wet = preferences.getInt(MS_NEAR_WET_SETTING_KEY);
		state.s[MS_SENSOR_MID].wet = preferences.getInt(MS_MID_WET_SETTING_KEY);
		state.s[MS_SENSOR_FAR].wet = preferences.getInt(MS_FAR_WET_SETTING_KEY);

		state.s[MS_SENSOR_NEAR].active = preferences.getBool(MS_NEAR_ACTIVE_SETTING_KEY, true);
		state.s[MS_SENSOR_MID].active = preferences.getBool(MS_MID_ACTIVE_SETTING_KEY, true);
		state.s[MS_SENSOR_FAR].active = preferences.getBool(MS_FAR_ACTIVE_SETTING_KEY, true);

		settings.apv = preferences.getInt(MS_APV_SETTING_KEY, settings.apv);
		settings.dapv = preferences.getInt(MS_DAPV_SETTING_KEY, settings.dapv);

		settings.pd = preferences.getULong(MS_PUMP_MAX_DURATION, settings.pd);
		settings.pi = preferences.getULong(MS_PUMP_REACT_INT_DURATION, settings.pi);

		settings.sid = preferences.getULong(MS_SENSOR_INTERVAL_DRY, settings.sid);
		settings.siw = preferences.getULong(MS_SENSOR_INTERVAL_PUMPING, settings.siw);
		availableActions[SENSORS_ACTION].td = preferences.getULong(MS_SENSOR_INTERVAL_ON, availableActions[SENSORS_ACTION].td);
		wifi.state = (preferences.getBool(MS_WIFI_TOGGLE_SETTING_KEY, false) ? MS_WIFI_DISCONNECTED : MS_WIFI_STOPPED);
		if (wifi.state != MS_WIFI_STOPPED) {
			scheduleAction(&executionList, &availableActions[WIFI_ACTION]);
		}
#else
		int nd = 0, md = 0, fd = 0, nw = 0, mw = 0, fw = 0;
		EEPROM.get(0, nd);
		EEPROM.get(sizeof(int), md);
		EEPROM.get(sizeof(int) * 2, fd);
		EEPROM.get(sizeof(int) * 3, nw);
		EEPROM.get(sizeof(int) * 4, mw);
		EEPROM.get(sizeof(int) * 5, fw);
		state.s[MS_SENSOR_NEAR].dry = nd;
		state.s[MS_SENSOR_MID].dry = md;
		state.s[MS_SENSOR_FAR].dry = fd;

		state.s[MS_SENSOR_NEAR].wet = nw;
		state.s[MS_SENSOR_MID].wet = mw;
		state.s[MS_SENSOR_FAR].wet = fw;
#endif
		showTextCaptionScreen(&display, MS_STARTING_PROMPT_TEXT);
		// drawStartingValuesScreen(&display);
		delay(2000);
	}
	else {
		digitalWrite(SENSOR_PIN, SENSOR_PIN_HIGH);
#ifdef ARDUINO_ARCH_ESP32
		preferences.clear();
#else
		for (int i = 0; i < EEPROM.length(); i++) {
			EEPROM.put(i, 0);
		}
#endif
		display.clearDisplay();
		showActionPromptScreen(&display, "B2 for", "dry state");
		int br = readButton();
		while (!(br > BUTTON_2_LOW && br < BUTTON_2_HIGH)) {
			br = readButton();
		}
		display.clearDisplay();
		showTextCaptionScreen(&display, MS_READING_PROMPT_TEXT);

		// waiting for completely wet values
		extractMedianPinValueForProperty(1000, &state.s[MS_SENSOR_NEAR].dry, &state.s[MS_SENSOR_MID].dry, &state.s[MS_SENSOR_FAR].dry);
#ifdef ARDUINO_ARCH_ESP32
		preferences.putInt(MS_NEAR_DRY_SETTING_KEY, state.s[MS_SENSOR_NEAR].dry);
		preferences.putInt(MS_MID_DRY_SETTING_KEY, state.s[MS_SENSOR_MID].dry);
		preferences.putInt(MS_FAR_DRY_SETTING_KEY, state.s[MS_SENSOR_FAR].dry);
#else
		EEPROM.put(0, state.s[MS_SENSOR_NEAR].dry);
		EEPROM.put(sizeof(int), state.s[MS_SENSOR_MID].dry);
		EEPROM.put(sizeof(int) * 2, state.s[MS_SENSOR_FAR].dry);
#endif

		// fire buzzer to notify that dry values have been read
		drawDryValuesScreen(&display);
		delay(5000);
		display.clearDisplay();
		showActionPromptScreen(&display, "B2 for", "wet state");
		br = readButton();
		while (!(br > BUTTON_2_LOW && br < BUTTON_2_HIGH)) {
			br = readButton();
		}
		display.clearDisplay();
		showTextCaptionScreen(&display, MS_READING_PROMPT_TEXT);

		// waiting for completely wet values
		extractMedianPinValueForProperty(1000, &state.s[MS_SENSOR_NEAR].wet, &state.s[MS_SENSOR_MID].wet, &state.s[MS_SENSOR_FAR].wet);
#ifdef ARDUINO_ARCH_ESP32
		preferences.putInt(MS_NEAR_WET_SETTING_KEY, state.s[MS_SENSOR_NEAR].wet);
		preferences.putInt(MS_MID_WET_SETTING_KEY, state.s[MS_SENSOR_MID].wet);
		preferences.putInt(MS_FAR_WET_SETTING_KEY, state.s[MS_SENSOR_FAR].wet);
#else
		EEPROM.put(sizeof(int) * 3, state.s[MS_SENSOR_NEAR].wet);
		EEPROM.put(sizeof(int) * 4, state.s[MS_SENSOR_MID].wet);
		EEPROM.put(sizeof(int) * 5, state.s[MS_SENSOR_FAR].wet);
#endif


		// wet values have been read
		drawWetValuesScreen(&display);
		delay(5000);
		display.clearDisplay();
		showActionPromptScreen(&display, "B2", "start...");
		// click to continue
		br = readButton();
		while (!(br > BUTTON_2_LOW && br < BUTTON_2_HIGH)) {
			br = readButton();
		}
		showTextCaptionScreen(&display, MS_STARTING_PROMPT_TEXT);
		delay(2000);
		digitalWrite(SENSOR_PIN, SENSOR_PIN_LOW);
	}
#ifdef ARDUINO_ARCH_ESP32
	preferences.end();
#endif

}

// Fix for WIFI + analogRead from ADC2 issue

uint64_t reg_a;
uint64_t reg_b;
uint64_t reg_c;

void storeADC2ConfigRegisters() {
	//reg_a = READ_PERI_REG(SENS_SAR_START_FORCE_REG);
	reg_b = READ_PERI_REG(SENS_SAR_READ_CTRL2_REG);
	//reg_c = READ_PERI_REG(SENS_SAR_MEAS_START2_REG);
}

void restoreADC2ConfigRegisters() {
	//WRITE_PERI_REG(SENS_SAR_START_FORCE_REG, reg_a);
	WRITE_PERI_REG(SENS_SAR_READ_CTRL2_REG, reg_b);
	//WRITE_PERI_REG(SENS_SAR_MEAS_START2_REG, reg_c);
}

int fixedAnalogRead(int pin) {
	restoreADC2ConfigRegisters();
	SET_PERI_REG_MASK(SENS_SAR_READ_CTRL2_REG, SENS_SAR2_DATA_INV);
	return analogRead(pin);
}

//

void setup() {
	storeADC2ConfigRegisters();
	pinMode(PIN_FAR, INPUT);
	pinMode(PIN_MID, INPUT);
	pinMode(PIN_NEAR, INPUT);

	pinMode(PIN_VALVE_FAR, OUTPUT);
	pinMode(PIN_VALVE_MID, OUTPUT);
	pinMode(PIN_VALVE_NEAR, OUTPUT);

	digitalWrite(PIN_VALVE_FAR, HIGH);
	digitalWrite(PIN_VALVE_MID, HIGH);
	digitalWrite(PIN_VALVE_NEAR, HIGH);

	pinMode(BUTTONS_PIN, INPUT);

	pinMode(PUMP_PIN, OUTPUT); // pump relay
	digitalWrite(PUMP_PIN, PUMP_PIN_LOW);

	pinMode(SENSOR_PIN, OUTPUT); // sensor relay
	digitalWrite(SENSOR_PIN, SENSOR_PIN_LOW);
	Serial.begin(9600);

	allocateMemPools();

	setupInitialState();

	ms_init();
}

void loop() {
	doQueueActions(&executionList);
}
